# 개발 도구
brew "git"
brew "gh"
brew "stow"
brew "mas"
brew "direnv"
brew "ripgrep"
brew "jq"
brew "tree"
brew "dockutil"

# 언어/런타임 매니저
brew "pyenv"
brew "pyenv-virtualenv"
brew "nvm"
brew "rbenv"
brew "ruby-build"
brew "go"

# 유틸리티
brew "curl"
brew "awscli"

# Cask (GUI 앱) — 브라우저
cask "brave-browser"
cask "arc"

# Cask — 개발 도구
cask "iterm2"
cask "visual-studio-code"
cask "thebrowsercompany-dia"

# Cask — 생산성
cask "raycast"
cask "obsidian"
cask "notion"
cask "notion-calendar"
cask "notion-mail"
cask "google-drive"
cask "handy"

# Cask — 커뮤니케이션
cask "telegram"
cask "discord"

# Cask — AI
cask "claude"
cask "chatgpt"
cask "chatgpt-atlas"

# Cask — 유틸리티
cask "vlc"
cask "1password-cli"

# Mac App Store
mas "KakaoTalk", id: 869223134
mas "Slack", id: 803453959
mas "Spark", id: 1176895641
mas "Perplexity", id: 6714467650
mas "Get Plain Text", id: 508368068
