# CLI 도구
brew "gh"
brew "stow"
brew "direnv"
brew "ripgrep"
brew "jq"
brew "tree"
brew "fd"
brew "bat"
brew "fzf"
brew "htop"
brew "mas"

# 프롬프트
brew "starship"

# 언어/런타임 매니저
brew "pyenv"
brew "pyenv-virtualenv"
brew "nvm"

# 유틸리티
brew "awscli"

# Cask — 생산성
cask "obsidian"

# Cask — 개발 도구
cask "cmux"
cask "cursor"

# Cask — 커뮤니케이션
cask "telegram"
cask "discord"
cask "slack"

# Cask — 유틸리티
cask "1password"
cask "1password-cli"
cask "utm"
